## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd-gateway"
+               namespace = "kube-argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName = "argo-cert"
+                           mode           = "SIMPLE"
                        }
                    },
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = true
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-gateway"
+               namespace                  = "kube-argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "argo-cert"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = true
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.gateway_resource will be destroyed
  # (because kubernetes_manifest.gateway_resource is not in configuration)
-   resource "kubernetes_manifest" "gateway_resource" {
-       manifest = {
-           apiVersion = "networking.istio.io/v1beta1"
-           kind       = "Gateway"
-           metadata   = {
-               name      = "argocd-gateway"
-               namespace = "kube-argocd"
            }
-           spec       = {
-               selector = {
-                   istio = "ingressgateway"
                }
-               servers  = [
-                   {
-                       hosts = [
-                           "argocd.wayofthesys.org",
                        ]
-                       port  = {
-                           name     = "https"
-                           number   = 443
-                           protocol = "HTTPS"
                        }
-                       tls   = {
-                           credentialName = "argocd-secret"
-                           mode           = "SIMPLE"
                        }
                    },
-                   {
-                       hosts = [
-                           "argocd.wayofthesys.org",
                        ]
-                       port  = {
-                           name     = "http"
-                           number   = 80
-                           protocol = "HTTP"
                        }
-                       tls   = {
-                           httpsRedirect = false
                        }
                    },
                ]
            }
        } -> null
-       object   = {
-           apiVersion = "networking.istio.io/v1beta1"
-           kind       = "Gateway"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "argocd-gateway"
-               namespace                  = "kube-argocd"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               selector = {
-                   "istio" = "ingressgateway"
                }
-               servers  = [
-                   {
-                       bind            = null
-                       defaultEndpoint = null
-                       hosts           = [
-                           "argocd.wayofthesys.org",
                        ]
-                       name            = null
-                       port            = {
-                           name       = "https"
-                           number     = 443
-                           protocol   = "HTTPS"
-                           targetPort = null
                        }
-                       tls             = {
-                           caCertificates        = null
-                           cipherSuites          = null
-                           credentialName        = "argocd-secret"
-                           httpsRedirect         = null
-                           maxProtocolVersion    = null
-                           minProtocolVersion    = null
-                           mode                  = "SIMPLE"
-                           privateKey            = null
-                           serverCertificate     = null
-                           subjectAltNames       = null
-                           verifyCertificateHash = null
-                           verifyCertificateSpki = null
                        }
                    },
-                   {
-                       bind            = null
-                       defaultEndpoint = null
-                       hosts           = [
-                           "argocd.wayofthesys.org",
                        ]
-                       name            = null
-                       port            = {
-                           name       = "http"
-                           number     = 80
-                           protocol   = "HTTP"
-                           targetPort = null
                        }
-                       tls             = {
-                           caCertificates        = null
-                           cipherSuites          = null
-                           credentialName        = null
-                           httpsRedirect         = false
-                           maxProtocolVersion    = null
-                           minProtocolVersion    = null
-                           mode                  = null
-                           privateKey            = null
-                           serverCertificate     = null
-                           subjectAltNames       = null
-                           verifyCertificateHash = null
-                           verifyCertificateSpki = null
                        }
                    },
                ]
            }
        } -> null
    }

  # kubernetes_secret.zerossl-eab-hmac-key will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key-id"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-vl77l" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
